MikroElektronika/core_packages/PIC/XC8/def/PIC16F1717/mcu.h
extern volatile ODCONAbits_t ODCONAbits __at(0x28C);
// bitfield macros
#define _ODCONA_ODA0_POSN                                   0x0
#define _ODCONA_ODA0_POSITION                               0x0
#define _ODCONA_ODA0_SIZE                                   0x1
#define _ODCONA_ODA0_LENGTH                                 0x1
#define _ODCONA_ODA0_MASK                                   0x1
#define _ODCONA_ODA1_POSN                                   0x1
#define _ODCONA_ODA1_POSITION                               0x1
#define _ODCONA_ODA1_SIZE                                   0x1
#define _ODCONA_ODA1_LENGTH                                 0x1
#define _ODCONA_ODA1_MASK                                   0x2
#define _ODCONA_ODA2_POSN                                   0x2
#define _ODCONA_ODA2_POSITION                               0x2
#define _ODCONA_ODA2_SIZE                                   0x1
#define _ODCONA_ODA2_LENGTH                                 0x1
#define _ODCONA_ODA2_MASK                                   0x4
#define _ODCONA_ODA3_POSN                                   0x3
#define _ODCONA_ODA3_POSITION                               0x3
#define _ODCONA_ODA3_SIZE                                   0x1
#define _ODCONA_ODA3_LENGTH                                 0x1
#define _ODCONA_ODA3_MASK                                   0x8
#define _ODCONA_ODA4_POSN                                   0x4
#define _ODCONA_ODA4_POSITION                               0x4
#define _ODCONA_ODA4_SIZE                                   0x1
#define _ODCONA_ODA4_LENGTH                                 0x1
#define _ODCONA_ODA4_MASK                                   0x10
#define _ODCONA_ODA5_POSN                                   0x5
#define _ODCONA_ODA5_POSITION                               0x5
#define _ODCONA_ODA5_SIZE                                   0x1
#define _ODCONA_ODA5_LENGTH                                 0x1
#define _ODCONA_ODA5_MASK                                   0x20
#define _ODCONA_ODA6_POSN                                   0x6
#define _ODCONA_ODA6_POSITION                               0x6
#define _ODCONA_ODA6_SIZE                                   0x1
#define _ODCONA_ODA6_LENGTH                                 0x1
#define _ODCONA_ODA6_MASK                                   0x40
#define _ODCONA_ODA7_POSN                                   0x7
#define _ODCONA_ODA7_POSITION                               0x7
#define _ODCONA_ODA7_SIZE                                   0x1
#define _ODCONA_ODA7_LENGTH                                 0x1
#define _ODCONA_ODA7_MASK                                   0x80

// Register: ODCONB
#define ODCONB ODCONB
extern volatile unsigned char           ODCONB              __at(0x28D);
#ifndef _LIB_BUILD
asm("ODCONB equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODB0                   :1;
        unsigned ODB1                   :1;
        unsigned ODB2                   :1;
        unsigned ODB3                   :1;
        unsigned ODB4                   :1;
        unsigned ODB5                   :1;
        unsigned ODB6                   :1;
        unsigned ODB7                   :1;
    };
} ODCONBbits_t;
extern volatile ODCONBbits_t ODCONBbits __at(0x28D);
// bitfield macros
#define _ODCONB_ODB0_POSN                                   0x0
#define _ODCONB_ODB0_POSITION                               0x0
#define _ODCONB_ODB0_SIZE                                   0x1
#define _ODCONB_ODB0_LENGTH                                 0x1
#define _ODCONB_ODB0_MASK                                   0x1
#define _ODCONB_ODB1_POSN                                   0x1
#define _ODCONB_ODB1_POSITION                               0x1
#define _ODCONB_ODB1_SIZE                                   0x1
#define _ODCONB_ODB1_LENGTH                                 0x1
#define _ODCONB_ODB1_MASK                                   0x2
#define _ODCONB_ODB2_POSN                                   0x2
#define _ODCONB_ODB2_POSITION                               0x2
#define _ODCONB_ODB2_SIZE                                   0x1
#define _ODCONB_ODB2_LENGTH                                 0x1
#define _ODCONB_ODB2_MASK                                   0x4
#define _ODCONB_ODB3_POSN                                   0x3
#define _ODCONB_ODB3_POSITION                               0x3
#define _ODCONB_ODB3_SIZE                                   0x1
#define _ODCONB_ODB3_LENGTH                                 0x1
#define _ODCONB_ODB3_MASK                                   0x8
#define _ODCONB_ODB4_POSN                                   0x4
#define _ODCONB_ODB4_POSITION                               0x4
#define _ODCONB_ODB4_SIZE                                   0x1
#define _ODCONB_ODB4_LENGTH                                 0x1
#define _ODCONB_ODB4_MASK                                   0x10
#define _ODCONB_ODB5_POSN                                   0x5
#define _ODCONB_ODB5_POSITION                               0x5
#define _ODCONB_ODB5_SIZE                                   0x1
#define _ODCONB_ODB5_LENGTH                                 0x1
#define _ODCONB_ODB5_MASK                                   0x20
#define _ODCONB_ODB6_POSN                                   0x6
#define _ODCONB_ODB6_POSITION                               0x6
#define _ODCONB_ODB6_SIZE                                   0x1
#define _ODCONB_ODB6_LENGTH                                 0x1
#define _ODCONB_ODB6_MASK                                   0x40
#define _ODCONB_ODB7_POSN                                   0x7
#define _ODCONB_ODB7_POSITION                               0x7
#define _ODCONB_ODB7_SIZE                                   0x1
#define _ODCONB_ODB7_LENGTH                                 0x1
#define _ODCONB_ODB7_MASK                                   0x80

// Register: ODCONC
#define ODCONC ODCONC
extern volatile unsigned char           ODCONC              __at(0x28E);
#ifndef _LIB_BUILD
asm("ODCONC equ 028Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODC0                   :1;
        unsigned ODC1                   :1;
        unsigned ODC2                   :1;
        unsigned ODC3                   :1;
        unsigned ODC4                   :1;
        unsigned ODC5                   :1;
        unsigned ODC6                   :1;
        unsigned ODC7                   :1;
    };
} ODCONCbits_t;
