MikroElektronika/core_packages/PIC/XC8/def/PIC16F1717/mcu.h
// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x511);
#ifndef _LIB_BUILD
asm("OPA1CON equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA1CH                 :2;
        unsigned                        :2;
        unsigned OPA1UG                 :1;
        unsigned                        :1;
        unsigned OPA1SP                 :1;
        unsigned OPA1EN                 :1;
    };
    struct {
        unsigned OPA1CH0                :1;
        unsigned OPA1CH1                :1;
    };
    struct {
        unsigned OPA1PCH                :2;
    };
    struct {
        unsigned OPA1PCH0               :1;
        unsigned OPA1PCH1               :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x511);
// bitfield macros
#define _OPA1CON_OPA1CH_POSN                                0x0
#define _OPA1CON_OPA1CH_POSITION                            0x0
#define _OPA1CON_OPA1CH_SIZE                                0x2
#define _OPA1CON_OPA1CH_LENGTH                              0x2
#define _OPA1CON_OPA1CH_MASK                                0x3
#define _OPA1CON_OPA1UG_POSN                                0x4
#define _OPA1CON_OPA1UG_POSITION                            0x4
#define _OPA1CON_OPA1UG_SIZE                                0x1
#define _OPA1CON_OPA1UG_LENGTH                              0x1
#define _OPA1CON_OPA1UG_MASK                                0x10
#define _OPA1CON_OPA1SP_POSN                                0x6
#define _OPA1CON_OPA1SP_POSITION                            0x6
#define _OPA1CON_OPA1SP_SIZE                                0x1
#define _OPA1CON_OPA1SP_LENGTH                              0x1
#define _OPA1CON_OPA1SP_MASK                                0x40
#define _OPA1CON_OPA1EN_POSN                                0x7
#define _OPA1CON_OPA1EN_POSITION                            0x7
#define _OPA1CON_OPA1EN_SIZE                                0x1
#define _OPA1CON_OPA1EN_LENGTH                              0x1
#define _OPA1CON_OPA1EN_MASK                                0x80
#define _OPA1CON_OPA1CH0_POSN                               0x0
#define _OPA1CON_OPA1CH0_POSITION                           0x0
#define _OPA1CON_OPA1CH0_SIZE                               0x1
#define _OPA1CON_OPA1CH0_LENGTH                             0x1
#define _OPA1CON_OPA1CH0_MASK                               0x1
#define _OPA1CON_OPA1CH1_POSN                               0x1
#define _OPA1CON_OPA1CH1_POSITION                           0x1
#define _OPA1CON_OPA1CH1_SIZE                               0x1
#define _OPA1CON_OPA1CH1_LENGTH                             0x1
#define _OPA1CON_OPA1CH1_MASK                               0x2
#define _OPA1CON_OPA1PCH_POSN                               0x0
#define _OPA1CON_OPA1PCH_POSITION                           0x0
#define _OPA1CON_OPA1PCH_SIZE                               0x2
#define _OPA1CON_OPA1PCH_LENGTH                             0x2
#define _OPA1CON_OPA1PCH_MASK                               0x3
#define _OPA1CON_OPA1PCH0_POSN                              0x0
#define _OPA1CON_OPA1PCH0_POSITION                          0x0
#define _OPA1CON_OPA1PCH0_SIZE                              0x1
#define _OPA1CON_OPA1PCH0_LENGTH                            0x1
#define _OPA1CON_OPA1PCH0_MASK                              0x1
#define _OPA1CON_OPA1PCH1_POSN                              0x1
#define _OPA1CON_OPA1PCH1_POSITION                          0x1
#define _OPA1CON_OPA1PCH1_SIZE                              0x1
#define _OPA1CON_OPA1PCH1_LENGTH                            0x1
#define _OPA1CON_OPA1PCH1_MASK                              0x2

// Register: OPA2CON
#define OPA2CON OPA2CON
extern volatile unsigned char           OPA2CON             __at(0x515);
#ifndef _LIB_BUILD
asm("OPA2CON equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA2CH                 :2;
        unsigned                        :2;
        unsigned OPA2UG                 :1;
        unsigned                        :1;
        unsigned OPA2SP                 :1;
        unsigned OPA2EN                 :1;
    };
    struct {
        unsigned OPA2CH0                :1;
        unsigned OPA2CH1                :1;
    };
    struct {
        unsigned OPA2PCH                :2;
    };
    struct {
        unsigned OPA2PCH0               :1;
        unsigned OPA2PCH1               :1;
    };
} OPA2CONbits_t;
extern volatile OPA2CONbits_t OPA2CONbits __at(0x515);
// bitfield macros
#define _OPA2CON_OPA2CH_POSN                                0x0
#define _OPA2CON_OPA2CH_POSITION                            0x0
#define _OPA2CON_OPA2CH_SIZE                                0x2
#define _OPA2CON_OPA2CH_LENGTH                              0x2
#define _OPA2CON_OPA2CH_MASK                                0x3
#define _OPA2CON_OPA2UG_POSN                                0x4
#define _OPA2CON_OPA2UG_POSITION                            0x4
#define _OPA2CON_OPA2UG_SIZE                                0x1
#define _OPA2CON_OPA2UG_LENGTH                              0x1
#define _OPA2CON_OPA2UG_MASK                                0x10
#define _OPA2CON_OPA2SP_POSN                                0x6
#define _OPA2CON_OPA2SP_POSITION                            0x6
#define _OPA2CON_OPA2SP_SIZE                                0x1
#define _OPA2CON_OPA2SP_LENGTH                              0x1
#define _OPA2CON_OPA2SP_MASK                                0x40
#define _OPA2CON_OPA2EN_POSN                                0x7
#define _OPA2CON_OPA2EN_POSITION                            0x7
#define _OPA2CON_OPA2EN_SIZE                                0x1
#define _OPA2CON_OPA2EN_LENGTH                              0x1
#define _OPA2CON_OPA2EN_MASK                                0x80
#define _OPA2CON_OPA2CH0_POSN                               0x0
#define _OPA2CON_OPA2CH0_POSITION                           0x0
#define _OPA2CON_OPA2CH0_SIZE                               0x1
#define _OPA2CON_OPA2CH0_LENGTH                             0x1
#define _OPA2CON_OPA2CH0_MASK                               0x1
#define _OPA2CON_OPA2CH1_POSN                               0x1
#define _OPA2CON_OPA2CH1_POSITION                           0x1
#define _OPA2CON_OPA2CH1_SIZE                               0x1
#define _OPA2CON_OPA2CH1_LENGTH                             0x1
#define _OPA2CON_OPA2CH1_MASK                               0x2
#define _OPA2CON_OPA2PCH_POSN                               0x0
#define _OPA2CON_OPA2PCH_POSITION                           0x0
#define _OPA2CON_OPA2PCH_SIZE                               0x2
#define _OPA2CON_OPA2PCH_LENGTH                             0x2
#define _OPA2CON_OPA2PCH_MASK                               0x3
#define _OPA2CON_OPA2PCH0_POSN                              0x0
#define _OPA2CON_OPA2PCH0_POSITION                          0x0
#define _OPA2CON_OPA2PCH0_SIZE                              0x1
#define _OPA2CON_OPA2PCH0_LENGTH                            0x1
#define _OPA2CON_OPA2PCH0_MASK                              0x1
#define _OPA2CON_OPA2PCH1_POSN                              0x1
#define _OPA2CON_OPA2PCH1_POSITION                          0x1
#define _OPA2CON_OPA2PCH1_SIZE                              0x1
#define _OPA2CON_OPA2PCH1_LENGTH                            0x1
#define _OPA2CON_OPA2PCH1_MASK                              0x2

